Revit 2024 API
BuiltInFailures.BendFailures.NotBentRefPlane Property
 While making curved beam type "[Type Name]" some Reference Plane elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentRefPlane { get; }
Visual Basic
Public Shared ReadOnly Property NotBentRefPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentRefPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace